capstone-workbook.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-28 Tue 23:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>System Integration of Autonomous Vehicle</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yu-shen" />
</head>
<body>
<div id="content">
<h1 class="title">System Integration of Autonomous Vehicle</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org736e048">1. Introduction</a></li>
<li><a href="#org48fc867">2. Plan and Schedule</a></li>
<li><a href="#orgcbefc92">3. Questions/Problems</a></li>
<li><a href="#orgb6ca869">4. Major nodes or modules</a>
<ul>
<li><a href="#org8e59658">4.1. ./waypoint_tracker.org</a></li>
<li><a href="#org4e9534f">4.2. Waypoint<sub>Updater</sub></a></li>
<li><a href="#org968bc6b">4.3. DBW<sub>Node</sub></a></li>
<li><a href="#orge98c382">4.4. ./tl_detector.org</a></li>
<li><a href="#org52ff36f">4.5. ./tl-classification.org</a></li>
</ul>
</li>
<li><a href="#org46bbc5c">5. <span class="todo TODO">TODO</span> TODO</a></li>
</ul>
</div>
</div>

<div id="outline-container-org736e048" class="outline-2">
<h2 id="org736e048"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
The document uses <a href="https://en.wikipedia.org/wiki/Literate_programming">literate programming</a> approach to present the
design and implementation. It presents software construction as prose of writing natural language narrative.
The key distinction is that all text are comments to code, while code are presented in special code block.
For details of it, please check the link for it.
With this style of narrative, key chunks of code relevant to higher level design are presented with
much more thought process presented. This would make the source code much more understandable, removing the challenges of providing
updated and appropriate comments to the source code.
</p>

<p>
In this document, <code>&lt;&lt;to_local_coordinates&gt;&gt;</code> standards for the named source code block to be inserted in the place.
</p>

<p>
In this design document, "my<sub>car</sub>" refers to the car being controlled by the path planner.
</p>

<p>
The full source code can be generated from this literate programming document: <a href="./capstone-workbook.html">./capstone-workbook.html</a>
If you prefer to read the source code, you can still read them, but there may not be enough comments.
</p>
</div>
</div>

<div id="outline-container-org48fc867" class="outline-2">
<h2 id="org48fc867"><span class="section-number-2">2</span> Plan and Schedule</h2>
<div class="outline-text-2" id="text-2">
<p>
Outdated
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tas</th>
<th scope="col" class="org-left">Owner</th>
<th scope="col" class="org-left">Due</th>
<th scope="col" class="org-left">Status</th>
<th scope="col" class="org-left">Remarks</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Waypoint<sub>Updater</sub> (initial)</td>
<td class="org-left">Yu</td>
<td class="org-left">11/1</td>
<td class="org-left">Verified 10/31</td>
<td class="org-left">Learning curve of ROS</td>
</tr>

<tr>
<td class="org-left">Traffic Light Detection &amp; Classification</td>
<td class="org-left">Reddy &amp; Sahil</td>
<td class="org-left">11/15</td>
<td class="org-left">Start 11/6</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">DBW to issue control</td>
<td class="org-left">Eric? &amp; ?</td>
<td class="org-left">11/5</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Waypoint<sub>Updater</sub> (deceleration/acceleration</td>
<td class="org-left">Patrick &amp; Yu</td>
<td class="org-left">11/20</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Integration</td>
<td class="org-left">Yu &amp; ?</td>
<td class="org-left">11/25</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Verification and tuning</td>
<td class="org-left">? &amp; all</td>
<td class="org-left">11/30</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
This is a rather rough schedule. It shows that it's already very tight for 11/30 to complete.
</p>

<p>
For Waypoint<sub>Updater</sub>, the remaining work is to subscribe to traffic light waypoints, and decide appropriate deceleration at the red/yellow light
and subsequent acceleration after getting green light.
</p>

<p>
The traffic light detection should pubilsh message of traffic light (being red, greee, maybe yellow).
</p>

<p>
For DBW<sub>node</sub>, the key remaining piece is TwistController, producing the appropriate throttle, steering, brake values based on
the current speed, the desired speed, and dbw<sub>enabled</sub> status. For the TwistController,
there is a PID implementation, but the parameters of P, I, D needs to be determined.
</p>
</div>
</div>

<div id="outline-container-orgcbefc92" class="outline-2">
<h2 id="orgcbefc92"><span class="section-number-2">3</span> Questions/Problems</h2>
<div class="outline-text-2" id="text-3">
<p>
Outdated.
</p>
<ol class="org-ol">
<li>In Waypoint<sub>Updater</sub>, for output final<sub>points</sub>, how to set the speed? Should we set both the linear and angular speed?
It seems that only need to set the linear.x, as it's in the my<sub>car</sub>'s local coordinates, there is only movement on the x-axis.
There is no movement on the angular z, not even possible on x, and y. It seems that we should also set the angular velocity on z-axis? but how?</li>
<li>How to tune the parameters of PID?</li>
<li>Where to use the lowpass filter, for the inputs to DBW<sub>node</sub> or its outputs, or both? Maybe, just the current velocity, as it's the only value from the physical world that might have noise.</li>
<li>What's the physics formula to express the required brake force considering the mass of the vehicle, its current velocities?</li>
</ol>
</div>
</div>

<div id="outline-container-orgb6ca869" class="outline-2">
<h2 id="orgb6ca869"><span class="section-number-2">4</span> Major nodes or modules</h2>
<div class="outline-text-2" id="text-4">
<p>
The following are the major nodes or modules clicking on the links can
visit the corresponding design and construction document.
</p>
</div>

<div id="outline-container-org8e59658" class="outline-3">
<h3 id="org8e59658"><span class="section-number-3">4.1</span> <a href="./waypoint_tracker.html">./waypoint_tracker.html</a></h3>
<div class="outline-text-3" id="text-4-1">
<p>
This is the supper class abstracting the common treatments to waypoints among
waypoint<sub>updater</sub> and tl<sub>dectector</sub>.
</p>

<p>
It resides in a module called waypoint<sub>lib</sub>
</p>

<p>
To import:
</p>
<p>
==:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">from</span> waypoint_lib.waypoint_tracker <span style="color: #4f97d7; font-weight: bold;">import</span> WaypointTracker
</pre>
</div>
</div>
</div>

<div id="outline-container-org4e9534f" class="outline-3">
<h3 id="org4e9534f"><span class="section-number-3">4.2</span> <a href="waypoint_updater.html">Waypoint<sub>Updater</sub></a></h3>
</div>

<div id="outline-container-org968bc6b" class="outline-3">
<h3 id="org968bc6b"><span class="section-number-3">4.3</span> <a href="dbw_workbook.html">DBW<sub>Node</sub></a></h3>
</div>

<div id="outline-container-orge98c382" class="outline-3">
<h3 id="orge98c382"><span class="section-number-3">4.4</span> <a href="./tl_detector.html">./tl_detector.html</a></h3>
</div>

<div id="outline-container-org52ff36f" class="outline-3">
<h3 id="org52ff36f"><span class="section-number-3">4.5</span> <a href="./tl-classification.html">./tl-classification.html</a></h3>
<div class="outline-text-3" id="text-4-5">
<p>
This is the wrapper to the deep learning classifer.
</p>

<p>
It expects to access the file of the trained module at path: ./ros/src/trained<sub>model</sub>/frozen<sub>inference</sub><sub>graph.pb</sub>
assuming the current directory is the project directory of the Capstone project.
</p>
</div>
</div>
</div>

<div id="outline-container-org46bbc5c" class="outline-2">
<h2 id="org46bbc5c"><span class="section-number-2">5</span> <span class="todo TODO">TODO</span> TODO</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: \today</p>
<p class="author">Author: yu-shen</p>
<p class="date">Created: 2017-11-28 Tue 23:09</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
